huangcc1996/RTX_STM32/user/myheader.h
#ifndef __MYHEADER_H
#define __MYHEADER_H
//C¿â
#include "stdio.h"
#include "stdlib.h"
#include "math.h"

#include "stm32f10x.h"
#include "GPIOLIKE51.h"
#include "RTL.h"

//bsp
#include "myusart.h"
//stm32¿â
#include "stm32f10x_adc.h"
#include "stm32f10x_bkp.h"
#include "stm32f10x_can.h"
#include "stm32f10x_cec.h"
#include "stm32f10x_crc.h"
#include "stm32f10x_dac.h"
#include "stm32f10x_dbgmcu.h"
#include "stm32f10x_dma.h"
#include "stm32f10x_exti.h"
#include "stm32f10x_flash.h"
#include "stm32f10x_fsmc.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_i2c.h"
#include "stm32f10x_iwdg.h"
#include "stm32f10x_pwr.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_rtc.h"
#include "stm32f10x_sdio.h"
#include "stm32f10x_spi.h"
#include "stm32f10x_tim.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_wwdg.h"


extern OS_TID HandleTaskUart1;
extern u8 HexToChar(u8 chr);
extern u8 RECBUF[1024];
#endif



